#### Day 32 of Python Programming

##  Reading Data with Pandas: CSV

### Introduction:
Pandas is a powerful tool for reading and manipulating structured data like CSV, Excel, or even databases. The most common data source is the CSV format.

### Step 1: Reading CSV Files
The most common function for loading data into pandas is read_csv().

In [10]:
import pandas as pd

# Reading a CSV file
df = pd.read_csv('samplefile.csv', delimiter= ';')

# Displaying the first few rows
print(df.head())
df

    Name   Age       City Occupation  Salary($)
0   John  32.0      Lagos     Doctor     2000.0
1   Mary  27.0  Frankfurt      Nurse     1500.0
2  Felix  42.0       Bonn     Lawyer     2800.0
3   Marc  45.0     Jersey     Lawyer     4000.0
4   Anna  32.0       Abia    Teacher     1200.0

      Name   Age       City Occupation  Salary($)
0     John  32.0      Lagos     Doctor     2000.0
1     Mary  27.0  Frankfurt      Nurse     1500.0
2    Felix  42.0       Bonn     Lawyer     2800.0
3     Marc  45.0     Jersey     Lawyer     4000.0
4     Anna  32.0       Abia    Teacher     1200.0
5     Linc   NaN    Cologne      Pilot     4000.0
6    Sarah  35.0        NaN    Manager     3500.0
7    Derek  49.0      Paris        NaN     2000.0
8     Mark  50.0     Russia     Banker     3400.0
9   Kelvin  34.0   New York    Plumber     1500.0
10     Tim  23.0        NaN     Dancer     2000.0
11  Cooper  24.0      Abuja   Youtuber        NaN
12    Matt  76.0      Italy    Retired        NaN
13     Ben  43.0     Russia   Enginner     5000.0

### Basic DataFrame Operations

In [11]:
print(df.tail())  # Displays the last 5 rows by default
print(df.shape)  # Prints (number of rows, number of columns)
print(df.columns)  # Prints the column names
print(df.index)  # Prints the index
print(df['Name'])  # Prints the 'Name' column
print(df[['Name', 'Age']])  # Prints 'Name' and 'Age' columns

      Name   Age      City Occupation  Salary($)
9   Kelvin  34.0  New York    Plumber     1500.0
10     Tim  23.0       NaN     Dancer     2000.0
11  Cooper  24.0     Abuja   Youtuber        NaN
12    Matt  76.0     Italy    Retired        NaN
13     Ben  43.0    Russia   Enginner     5000.0
(14, 5)
Index(['Name', 'Age', 'City', 'Occupation', 'Salary($)'], dtype='object')
RangeIndex(start=0, stop=14, step=1)
0       John
1       Mary
2      Felix
3       Marc
4       Anna
5       Linc
6      Sarah
7      Derek
8       Mark
9     Kelvin
10       Tim
11    Cooper
12      Matt
13       Ben
Name: Name, dtype: object
      Name   Age
0     John  32.0
1     Mary  27.0
2    Felix  42.0
3     Marc  45.0
4     Anna  32.0
5     Linc   NaN
6    Sarah  35.0
7    Derek  49.0
8     Mark  50.0
9   Kelvin  34.0
10     Tim  23.0
11  Cooper  24.0
12    Matt  76.0
13     Ben  43.0

### Aggregation and Grouping

In [14]:
print(df['Age'].mean())  # Mean of 'Age'
print(df['Age'].median())  # Median of 'Age'
print(df['Age'].std())  # Standard deviation of 'Age'

39.38461538461539
35.0
14.180611537932473

### Practice Questions:
Load a CSV file into pandas and print the first 5 rows.

Read an Excel file and display the last 10 rows.

Load data from a JSON file and show its columns.